tap "cloudflare/cloudflare"
tap "ddev/ddev"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nicoverbruggen/cask"
tap "romkatv/powerlevel10k"
tap "shivammathur/php"
tap "supabase/tap"
tap "teamookla/speedtest"
brew "jpeg-xl"
brew "aom"
brew "bash"
brew "bash-completion"
brew "bat"
brew "brew-cask-completion"
brew "cairo"
brew "cmake"
brew "cocoapods"
brew "cryptography"
brew "curl"
brew "fd"
brew "harfbuzz"
brew "icu4c@76"
brew "python@3.13"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "libavif"
brew "httpie"
brew "httrack"
brew "imagemagick"
brew "jq"
brew "libfido2"
brew "mkcert"
brew "mycli"
brew "mysql"
brew "mysql@5.7"
brew "node"
brew "openjdk@17"
brew "php@8.2", link: true
brew "pipx"
brew "pngpaste"
brew "pngquant"
brew "pnpm"
brew "powerlevel10k"
brew "putty"
brew "python@3.11"
brew "qt"
brew "ripgrep"
brew "sleepwatcher"
brew "stow"
brew "tldr"
brew "tree"
brew "wrk"
brew "yarn"
brew "zoxide"
brew "ddev/ddev/ddev"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
brew "supabase/tap/supabase"
brew "teamookla/speedtest/speedtest"
cask "android-platform-tools"
cask "android-studio"
cask "anydesk"
cask "firefox"
cask "git-credential-manager"
cask "google-chrome"
cask "marta"
cask "microsoft-edge"
cask "ngrok"
cask "phpmon"
cask "qt-creator"
cask "raycast"
cask "teamviewer"
cask "warp"
vscode "apollographql.vscode-apollo"
vscode "astro-build.astro-vscode"
vscode "asuka.insertnumbers"
vscode "avetis.tokyo-night"
vscode "bradlc.vscode-tailwindcss"
vscode "capaj.vscode-standardjs-snippets"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "eiminsasete.apacheconf-snippets"
vscode "eliostruyf.vscode-front-matter"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "jerryhong.autofilename"
vscode "jsynowiec.vscode-insertdatestring"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "misterj.vue-volar-extention-pack"
vscode "mrmlnc.vscode-apache"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-speech-language-pack-zh-tw"
vscode "numso.prettier-standard-vscode"
vscode "oderwat.indent-rainbow"
vscode "openai.openai-chatgpt-adhoc"
vscode "pepri.subtitles-editor"
vscode "rvest.vs-code-prettier-eslint"
vscode "sissel.shopify-liquid"
vscode "spades.vs-picgo"
vscode "stylelint.vscode-stylelint"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
