# ==========================================
# Homebrew Bundle Configuration
# ==========================================

# Homebrew Taps
tap "cloudflare/cloudflare"                # Cloudflare tools
tap "ddev/ddev"                            # DDEV local development
tap "homebrew/bundle"                      # Brewfile support
tap "homebrew/services"                    # Service management
tap "nicoverbruggen/cask"                  # Additional casks
tap "romkatv/powerlevel10k"                # Zsh theme
tap "shivammathur/php"                     # Multiple PHP versions
tap "supabase/tap"                         # Supabase CLI
tap "teamookla/speedtest"                  # Speedtest CLI

# ==========================================
# Command Line Tools & Utilities
# ==========================================
brew "bash"
brew "bash-completion"
brew "bat"                    # Better cat with syntax highlighting
brew "brew-cask-completion"
brew "eza"                    # Modern ls replacement with Git integration
brew "fd"                     # Better find alternative
brew "fzf"                    # Fuzzy finder
brew "gh"                     # GitHub CLI
brew "git-delta"              # Better git diff viewer
brew "jq"                     # JSON processor
brew "lazygit"                # Terminal UI for git commands
brew "ripgrep"                # Better grep
brew "sleepwatcher"           # Monitor system sleep
brew "stow"                   # Symlink management
brew "tldr"                   # Simplified man pages
brew "tree"                   # Directory structure display
brew "watch"                  # Execute commands repeatedly
brew "zoxide"                 # Smart cd command

# ==========================================
# Development Environment
# ==========================================
## Web Development
brew "node"                   # JavaScript runtime
brew "pnpm"                   # Fast package manager
brew "yarn"                   # Package manager

## PHP Development
brew "php@8.2", link: true
brew "ddev/ddev/ddev"         # Local development environment
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"

## Database
brew "mysql"
brew "mysql@5.7"
brew "mycli"                  # MySQL CLI with auto-completion

## Other Development Tools
brew "cmake"
brew "cocoapods"              # iOS dependency manager
brew "cryptography"
brew "curl"
brew "openjdk@17"
brew "mkcert"                 # Local SSL certificates

# Development Tools
brew "direnv"                 # Environment variable management
brew "mise"                   # Runtime version manager (replaces asdf)
brew "just"                   # Command runner (Makefile alternative)
brew "tokei"                  # Code statistics tool
brew "hyperfine"              # Benchmark tool for commands

# Media & Image Processing
brew "ffmpeg"                 # Video/audio processing
brew "imagemagick"            # Image processing
brew "pngpaste"               # PNG clipboard tool
brew "pngquant"               # PNG optimization

# Supporting Libraries
brew "jpeg-xl"
brew "aom"
brew "cairo"
brew "harfbuzz"
brew "icu4c@76"
brew "libavif"
brew "libfido2"

# Network Tools
brew "httpie"                 # User-friendly HTTP client
brew "httrack"                # Website downloader
brew "teamookla/speedtest/speedtest"

# Python
brew "python@3.13"
brew "python@3.11"
brew "pipx"                   # Install Python applications

# Terminal Enhancement
brew "powerlevel10k"          # Zsh theme

# Third-party Services
brew "supabase/tap/supabase"

# ==========================================
# GUI Applications
# ==========================================
## Development Tools
cask "android-platform-tools"
cask "android-studio"         # Android development
cask "git-credential-manager"
cask "phpmon"                 # PHP version manager
cask "warp"                   # Modern terminal
cask "raycast"                # Spotlight replacement with productivity features
cask "proxyman"               # HTTP debugging proxy

## Browsers
cask "google-chrome"
cask "microsoft-edge"

## Productivity & Utilities
cask "keka"                   # Archive utility
cask "cleanmaster- system"   # System cleaning tool

# ==========================================
# VS Code Extensions
# ==========================================
## Core Development & Formatting
vscode "esbenp.prettier-vscode"                    # Code formatter
vscode "dbaeumer.vscode-eslint"                    # JavaScript linter
vscode "ms-ceintl.vscode-language-pack-zh-hant"    # 繁體中文語言包

## AI & Copilot
vscode "github.copilot"                            # AI coding assistant
vscode "github.copilot-chat"                       # AI chat assistant
vscode "github.copilot-labs"                       # Copilot experimental features

## Web Development
vscode "bradlc.vscode-tailwindcss"                 # Tailwind CSS IntelliSense
vscode "vue.volar"                                 # Vue.js official extension
vscode "astro-build.astro-vscode"                  # Astro framework support
vscode "formulahendry.auto-close-tag"              # Auto close HTML tags
vscode "formulahendry.auto-rename-tag"             # Auto rename paired tags
vscode "christian-kohler.path-intellisense"        # File path autocomplete
vscode "bradlc.vscode-styled-components"           # Styled components syntax

## Git & Version Control
vscode "mhutchie.git-graph"                        # Git graph visualization
vscode "github.vscode-github-actions"              # GitHub Actions support
vscode "eamodio.gitlens"                           # GitLens - supercharge Git
vscode "github.vscode-pull-request-github"         # GitHub Pull Requests

## Language Support
vscode "dart-code.dart-code"                       # Dart language support
vscode "dart-code.flutter"                         # Flutter development
vscode "ms-python.python"                          # Python extension
vscode "golang.go"                                 # Go language support
vscode "rust-lang.rust-analyzer"                  # Rust analyzer

## Productivity & Utilities
vscode "formulahendry.code-runner"                 # Run code snippets quickly
vscode "oderwat.indent-rainbow"                    # Colorize indentation levels
vscode "mechatroner.rainbow-csv"                   # Enhanced CSV viewer
vscode "davidanson.vscode-markdownlint"            # Markdown linting
vscode "yzhang.markdown-all-in-one"                # Markdown all-in-one
vscode "jsynowiec.vscode-insertdatestring"         # Insert current date/time
vscode "asuka.insertnumbers"                       # Insert sequential numbers
vscode "jerryhong.autofilename"                    # Auto filename completion
vscode "ms-vscode.vscode-json"                     # JSON language features

## Docker & Remote Development
vscode "ms-azuretools.vscode-docker"               # Docker container support
vscode "ms-vscode-remote.remote-containers"        # Dev containers
vscode "ms-vscode-remote.remote-ssh"               # Remote SSH development
vscode "ms-vscode-remote.remote-wsl"               # WSL development

## Themes & UI
vscode "enkia.tokyo-night"                         # Tokyo Night theme
vscode "pkief.material-icon-theme"                 # Material icon theme
vscode "zhuangtongfa.material-theme"               # One Dark Pro theme